import { title } from "process";
import { IAction, IState, ITabs } from "../modules";

const initialState: IState = {
	navMenu: [
		{ id: 1, name: 'home', link: '', label: 'Главная' },
		{ id: 2, name: 'products', link: 'products', label: 'Продукты' },
		{ id: 3, name: 'blog', link: 'blog', label: 'Блог' },
		{ id: 4, name: 'contacts', link: 'contacts', label: 'Контакты' }
	],
	contentHome: [
		{ id: 1, title: 'Передовая кибербезопасность для любой компании ', description: 'Защитите ваш бизнес от всех видов киберугроз с помощью решений мирового класса.', image: 'https://i.ibb.co/z6d4c9s/unsplash-sxi-Sod0ty-YQ.png' },
		{
			id: 2, title: 'Кибербезопасность нового поколения', description: 'Масштабируемая защита от самых сложных киберугроз, учитывающая потребности вашего бизнеса. ', swipers: [
				{ id: 1, image: 'https://i.ibb.co/KDKVjMS/unsplash-Av-SFPw5-Tp68-1.png' },
				{ id: 2, image: 'https://i.ibb.co/vBVn4qD/unsplash-Av-SFPw5-Tp68-2.png' },
				{ id: 3, image: 'https://i.ibb.co/k0Yz8GB/unsplash-Av-SFPw5-Tp68.png' },
			]
		},
		{
			id: 3, title: 'Инструменты', description: 'Тестирование на проникновение позволяет ответить на вопрос, как кто-то со злым умыслом может вмешаться в вашу сеть.', images: [
				{ id: 1, image: 'https://i.ibb.co/Kjymb4S/Metasploit.png' },
				{ id: 2, image: 'https://i.ibb.co/Kjymb4S/Metasploit.png' },
				{ id: 3, image: 'https://i.ibb.co/Kjymb4S/Metasploit.png' },
				{ id: 4, image: 'https://i.ibb.co/Kjymb4S/Metasploit.png' },
			]
		},
		{
			id: 4, title: 'Наши продукты направлены на вашу безопасность.', description: 'Мы придерживаемся в своей работе простого принципа: детектировать и блокировать любую вредоносную атаку.', products: [
				{ id: 1, image: 'https://i.ibb.co/jDkxMfw/Anon-ico.png', title: 'Анонимность' },
				{ id: 2, image: 'https://i.ibb.co/bvdmwF0/check-icon.png', title: 'Проверка на наличие угроз' },
				{ id: 3, image: 'https://i.ibb.co/sWjLBs8/protect.png', title: 'Обнаружение и предотвращение аттак' },
			]
		},
		{
			id: 5, title: 'Вы можете связаться с нами удобным для Вас способом', info: [
				{ id: 1, title: 'Ленинградский пр-т., 27, к2', image: 'https://i.ibb.co/Xjy30dX/Contact.png', link: '' },
				{ id: 2, title: '+7 (495) 000 - 00 - 00', image: 'https://i.ibb.co/syBK89K/Contact-1.png', link: 'tel:+74950000000' },
				{ id: 3, title: 'admin@trustcrypt.com', image: 'https://i.ibb.co/DgrrgRC/Contact-2.png', link: 'mailto:admin@trustcrypt.com' },
			]
		}
	],
	contentProducts: [
		{
			id: 1, title: 'Наши продукты', descr: 'Мы придерживаемся в своей работе простого принципа: детектировать и блокировать любую вредоносную атаку.'
		},
	],
	contentBlog: [
		{
			id: 1, title: 'Последние события в мире киберпространства', descr: 'Ознакомьтесь с информацией, чтобы быть в курсе новейших киберугроз и получить советы экспертов по безопасности.'
		},
	],
	newsBlog: [
		{ id: 1, title: 'Что такое фишинг и как от него защититься?', description: 'Фишинг (phishing, от fishing — рыбная ловля, выуживание) — вид интернет-мошенничества, целью которого является получение идентификационных данных пользователей (логины и пароли к банковским картам, учетным записям). Чаще всего фишинг представляет собой массовые рассылки писем и уведомлений от имени известных брендов, банков, платежных систем, почтовых сервисов, социальных сетей. Такие письма, как правило, содержат логотип, сообщение и прямую ссылку на сайт, внешне неотличимый от настоящего. По ссылке требуется перейти на сайт «сервиса» и под различными предлогами ввести конфиденциальные данные в соответствующие формы. В результате мошенники получают доступ к аккаунтам и банковским счетам пользователей.', views: 1, image: 'https://i.ibb.co/1qj9DB9/unsplash-HAq24cfcd-Lg.png', date: '2023-05-04', category: 'Фишинг' },
		{ id: 2, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/6nNk6Ct/unsplash-w-UPn-Myg-Sw-Yk.png', date: '2023-05-04', category: 'Советы' },
		{ id: 3, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/RD1Rj3X/unsplash-OUJOl-ZBvz60.png', date: '2023-05-04', category: 'Способы' },

		{ id: 4, title: 'Следующая Mass Effect перешла на этап полноценной разработки в начале 2022 года. Релиз состоится ещё не скоро, так как основная часть BioWare пока занята Dragon Age: Dreadwolf — её релиз ожидается в конце 2023-го, но официально это не подтвердили.', description: 'Студия BioWare поделилась прогрессом создания следующей игры из серии Mass Effect. В официальном блоге на сайте компании авторы отметили, что тайтл перешел на ранний этап разработки — еще в феврале команда обсуждала различные прототипы. Ранее глава BioWare рассказал, что производство возглавляет Майкл Гэмбл — он был менеджером проекта Mass Effect 2 и продюсером Mass Effect 3 и Andromeda. Кроме того, в команду входят как ветераны индустрии, так и очень талантливые новички. В марте к команде разработчиков новой Mass Effect присоединился популярный ютубер Майкл Такер. На своем канале Lessons from the Screenplay он разбирает различные сценарные решения в играх, кино и сериалах.', views: 1, image: 'https://i.ibb.co/qd0dY3L/unsplash-gny-A8vd3-Otc-1.png', date: '2023-05-02', category: 'Гейминг' },
		{ id: 5, title: 'Что такое кибербезопасность?', description: 'Кибербезопасность (ее иногда называют компьютерной безопасностью) – это совокупность методов и практик защиты от атак злоумышленников для компьютеров, серверов, мобильных устройств, электронных систем, сетей и данных. Кибербезопасность находит применение в самых разных областях, от бизнес-сферы до мобильных технологий.', views: 0, image: 'https://i.ibb.co/2vCRs4Y/unsplash-7-SDoly3-FV-0.png', date: '2023-05-01', category: 'Безопасность' },
		{
			id: 6, title: 'Что такое кодинг и зачем нужны тестировщики?', description: 'Нашу жизнь невозможно представить без компьютеров, смартфонов, а значит и нужного для их работы ПО. Всего этого не было бы без кодинга. Хотя это не новый термин, но люди всё еще плохо понимают, что он означает. Кодинг — это процесс написания программного кода или скрипта для выполнения определенного алгоритма. Этим занимаются кодеры. Считается, что для выполнения такой работы нужна хотя бы степень бакалавра. Многие кодеры — самоучки. Некоторые начинают с более скромной двухлетней программы и доучиваются уже на работе.', views: 0, image: 'https://i.ibb.co/vXYvpBL/unsplash-LJ9-KY8p-IH3-E.png', date: '2023-04-30', category: 'Разработка'
		},
		{ id: 12, title: 'Что такое фишинг и как от него защититься?', description: 'Фишинг (phishing, от fishing — рыбная ловля, выуживание) — вид интернет-мошенничества, целью которого является получение идентификационных данных пользователей (логины и пароли к банковским картам, учетным записям). Чаще всего фишинг представляет собой массовые рассылки писем и уведомлений от имени известных брендов, банков, платежных систем, почтовых сервисов, социальных сетей. Такие письма, как правило, содержат логотип, сообщение и прямую ссылку на сайт, внешне неотличимый от настоящего. По ссылке требуется перейти на сайт «сервиса» и под различными предлогами ввести конфиденциальные данные в соответствующие формы. В результате мошенники получают доступ к аккаунтам и банковским счетам пользователей.', views: 1, image: 'https://i.ibb.co/1qj9DB9/unsplash-HAq24cfcd-Lg.png', date: '2023-04-29', category: 'Фишинг' },
		{ id: 11, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/6nNk6Ct/unsplash-w-UPn-Myg-Sw-Yk.png', date: '2023-05-05', category: 'Советы' },
		{ id: 10, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/RD1Rj3X/unsplash-OUJOl-ZBvz60.png', date: '2023-04-28', category: 'Способы' },

		{ id: 9, title: 'Следующая Mass Effect перешла на этап полноценной разработки в начале 2022 года. Релиз состоится ещё не скоро, так как основная часть BioWare пока занята Dragon Age: Dreadwolf — её релиз ожидается в конце 2023-го, но официально это не подтвердили.', description: 'Студия BioWare поделилась прогрессом создания следующей игры из серии Mass Effect. В официальном блоге на сайте компании авторы отметили, что тайтл перешел на ранний этап разработки — еще в феврале команда обсуждала различные прототипы. Ранее глава BioWare рассказал, что производство возглавляет Майкл Гэмбл — он был менеджером проекта Mass Effect 2 и продюсером Mass Effect 3 и Andromeda. Кроме того, в команду входят как ветераны индустрии, так и очень талантливые новички. В марте к команде разработчиков новой Mass Effect присоединился популярный ютубер Майкл Такер. На своем канале Lessons from the Screenplay он разбирает различные сценарные решения в играх, кино и сериалах.', views: 1, image: 'https://i.ibb.co/qd0dY3L/unsplash-gny-A8vd3-Otc-1.png', date: '2023-04-27', category: 'Гейминг' },
		{ id: 8, title: 'Что такое кибербезопасность?', description: 'Кибербезопасность (ее иногда называют компьютерной безопасностью) – это совокупность методов и практик защиты от атак злоумышленников для компьютеров, серверов, мобильных устройств, электронных систем, сетей и данных. Кибербезопасность находит применение в самых разных областях, от бизнес-сферы до мобильных технологий.', views: 0, image: 'https://i.ibb.co/2vCRs4Y/unsplash-7-SDoly3-FV-0.png', date: '2023-04-26', category: 'Безопасность' },
		{
			id: 7, title: 'Что такое кодинг и зачем нужны тестировщики?', description: 'Нашу жизнь невозможно представить без компьютеров, смартфонов, а значит и нужного для их работы ПО. Всего этого не было бы без кодинга. Хотя это не новый термин, но люди всё еще плохо понимают, что он означает. Кодинг — это процесс написания программного кода или скрипта для выполнения определенного алгоритма. Этим занимаются кодеры. Считается, что для выполнения такой работы нужна хотя бы степень бакалавра. Многие кодеры — самоучки. Некоторые начинают с более скромной двухлетней программы и доучиваются уже на работе.', views: 0, image: 'https://i.ibb.co/vXYvpBL/unsplash-LJ9-KY8p-IH3-E.png', date: '2023-04-25', category: 'Разработка'
		},
		{ id: 13, title: 'Что такое фишинг и как от него защититься?', description: 'Фишинг (phishing, от fishing — рыбная ловля, выуживание) — вид интернет-мошенничества, целью которого является получение идентификационных данных пользователей (логины и пароли к банковским картам, учетным записям). Чаще всего фишинг представляет собой массовые рассылки писем и уведомлений от имени известных брендов, банков, платежных систем, почтовых сервисов, социальных сетей. Такие письма, как правило, содержат логотип, сообщение и прямую ссылку на сайт, внешне неотличимый от настоящего. По ссылке требуется перейти на сайт «сервиса» и под различными предлогами ввести конфиденциальные данные в соответствующие формы. В результате мошенники получают доступ к аккаунтам и банковским счетам пользователей.', views: 1, image: 'https://i.ibb.co/1qj9DB9/unsplash-HAq24cfcd-Lg.png', date: '2023-04-24', category: 'Фишинг' },
		{ id: 14, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/6nNk6Ct/unsplash-w-UPn-Myg-Sw-Yk.png', date: '2023-04-23', category: 'Советы' },
		{ id: 15, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/RD1Rj3X/unsplash-OUJOl-ZBvz60.png', date: '2023-04-22', category: 'Способы' },

		{ id: 16, title: 'Следующая Mass Effect перешла на этап полноценной разработки в начале 2022 года. Релиз состоится ещё не скоро, так как основная часть BioWare пока занята Dragon Age: Dreadwolf — её релиз ожидается в конце 2023-го, но официально это не подтвердили.', description: 'Студия BioWare поделилась прогрессом создания следующей игры из серии Mass Effect. В официальном блоге на сайте компании авторы отметили, что тайтл перешел на ранний этап разработки — еще в феврале команда обсуждала различные прототипы. Ранее глава BioWare рассказал, что производство возглавляет Майкл Гэмбл — он был менеджером проекта Mass Effect 2 и продюсером Mass Effect 3 и Andromeda. Кроме того, в команду входят как ветераны индустрии, так и очень талантливые новички. В марте к команде разработчиков новой Mass Effect присоединился популярный ютубер Майкл Такер. На своем канале Lessons from the Screenplay он разбирает различные сценарные решения в играх, кино и сериалах.', views: 1, image: 'https://i.ibb.co/qd0dY3L/unsplash-gny-A8vd3-Otc-1.png', date: '2023-04-23', category: 'Гейминг' },
		{ id: 17, title: 'Что такое кибербезопасность?', description: 'Кибербезопасность (ее иногда называют компьютерной безопасностью) – это совокупность методов и практик защиты от атак злоумышленников для компьютеров, серверов, мобильных устройств, электронных систем, сетей и данных. Кибербезопасность находит применение в самых разных областях, от бизнес-сферы до мобильных технологий.', views: 0, image: 'https://i.ibb.co/2vCRs4Y/unsplash-7-SDoly3-FV-0.png', date: '2023-04-22', category: 'Безопасность' },
		{
			id: 18, title: 'Что такое кодинг и зачем нужны тестировщики?', description: 'Нашу жизнь невозможно представить без компьютеров, смартфонов, а значит и нужного для их работы ПО. Всего этого не было бы без кодинга. Хотя это не новый термин, но люди всё еще плохо понимают, что он означает. Кодинг — это процесс написания программного кода или скрипта для выполнения определенного алгоритма. Этим занимаются кодеры. Считается, что для выполнения такой работы нужна хотя бы степень бакалавра. Многие кодеры — самоучки. Некоторые начинают с более скромной двухлетней программы и доучиваются уже на работе.', views: 0, image: 'https://i.ibb.co/vXYvpBL/unsplash-LJ9-KY8p-IH3-E.png', date: '2023-05-05', category: 'Разработка'
		},
		{ id: 19, title: 'Что такое фишинг и как от него защититься?', description: 'Фишинг (phishing, от fishing — рыбная ловля, выуживание) — вид интернет-мошенничества, целью которого является получение идентификационных данных пользователей (логины и пароли к банковским картам, учетным записям). Чаще всего фишинг представляет собой массовые рассылки писем и уведомлений от имени известных брендов, банков, платежных систем, почтовых сервисов, социальных сетей. Такие письма, как правило, содержат логотип, сообщение и прямую ссылку на сайт, внешне неотличимый от настоящего. По ссылке требуется перейти на сайт «сервиса» и под различными предлогами ввести конфиденциальные данные в соответствующие формы. В результате мошенники получают доступ к аккаунтам и банковским счетам пользователей.', views: 1, image: 'https://i.ibb.co/1qj9DB9/unsplash-HAq24cfcd-Lg.png', date: '2023-05-06', category: 'Фишинг' },
		{ id: 20, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/6nNk6Ct/unsplash-w-UPn-Myg-Sw-Yk.png', date: '2023-05-07', category: 'Советы' },
		{ id: 21, title: 'Фишинговая нотификация о привязке телефона', description: 'Антифишинг — платформа для формирования навыков противодействия всем видам цифровых атак на людей: через электронную почту, сайты, соцсети, мессенджеры и т.д.', views: 1, image: 'https://i.ibb.co/RD1Rj3X/unsplash-OUJOl-ZBvz60.png', date: '2023-05-08', category: 'Способы' },
		{ id: 22, title: 'Следующая Mass Effect перешла на этап полноценной разработки в начале 2022 года. Релиз состоится ещё не скоро, так как основная часть BioWare пока занята Dragon Age: Dreadwolf — её релиз ожидается в конце 2023-го, но официально это не подтвердили.', description: 'Студия BioWare поделилась прогрессом создания следующей игры из серии Mass Effect. В официальном блоге на сайте компании авторы отметили, что тайтл перешел на ранний этап разработки — еще в феврале команда обсуждала различные прототипы. Ранее глава BioWare рассказал, что производство возглавляет Майкл Гэмбл — он был менеджером проекта Mass Effect 2 и продюсером Mass Effect 3 и Andromeda. Кроме того, в команду входят как ветераны индустрии, так и очень талантливые новички. В марте к команде разработчиков новой Mass Effect присоединился популярный ютубер Майкл Такер. На своем канале Lessons from the Screenplay он разбирает различные сценарные решения в играх, кино и сериалах.', views: 1, image: 'https://i.ibb.co/qd0dY3L/unsplash-gny-A8vd3-Otc-1.png', date: '2023-05-09', category: 'Гейминг' },
		{ id: 23, title: 'Что такое кибербезопасность?', description: 'Кибербезопасность (ее иногда называют компьютерной безопасностью) – это совокупность методов и практик защиты от атак злоумышленников для компьютеров, серверов, мобильных устройств, электронных систем, сетей и данных. Кибербезопасность находит применение в самых разных областях, от бизнес-сферы до мобильных технологий.', views: 0, image: 'https://i.ibb.co/2vCRs4Y/unsplash-7-SDoly3-FV-0.png', date: '2023-05-05', category: 'Безопасность' },
		{
			id: 24, title: 'Что такое кодинг и зачем нужны тестировщики?', description: 'Нашу жизнь невозможно представить без компьютеров, смартфонов, а значит и нужного для их работы ПО. Всего этого не было бы без кодинга. Хотя это не новый термин, но люди всё еще плохо понимают, что он означает. Кодинг — это процесс написания программного кода или скрипта для выполнения определенного алгоритма. Этим занимаются кодеры. Считается, что для выполнения такой работы нужна хотя бы степень бакалавра. Многие кодеры — самоучки. Некоторые начинают с более скромной двухлетней программы и доучиваются уже на работе.', views: 0, image: 'https://i.ibb.co/vXYvpBL/unsplash-LJ9-KY8p-IH3-E.png', date: '2023-05-05', category: 'Разработка'
		},
	],
	tabsPageProducts: [
		{ id: 1, label: 'Все продукты', active: true },
		{ id: 2, label: '1 категория', active: false },
		{ id: 3, label: '2 категория', active: false },
		{ id: 4, label: '3 категория', active: false },
	],
	tabsPageBlog: [
		{ id: 1, label: 'Все статьи', active: true },
		{ id: 2, label: 'Фишинг', active: false },
		{ id: 3, label: 'Советы', active: false },
		{ id: 4, label: 'Способы', active: false },
		{ id: 5, label: 'Гейминг', active: false },
		{ id: 6, label: 'Безопасность', active: false },
		{ id: 7, label: 'Разработка', active: false },
	],
	products: [
		{
			id: 1, images: [
				{ id: 1, image: 'https://i.ibb.co/RYYJr8y/Rectangle-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/RYYJr8y/Rectangle-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/RYYJr8y/Rectangle-1.png', label: '' },
			], title: 'Название продукта 1', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 2, images: [
				{ id: 1, image: 'https://i.ibb.co/zJ9mDwf/image-2-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/zJ9mDwf/image-2-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/zJ9mDwf/image-2-1.png', label: '' },
			], title: 'Название продукта 2', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 3, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 3', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 4, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 4', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 5, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 5', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 6, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 6', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 7, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 7', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 8, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 8', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '1 категория'
		},
		{
			id: 9, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 9', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 10, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 10', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 11, images: [
				{ id: 1, image: 'https://i.ibb.co/RYYJr8y/Rectangle-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/RYYJr8y/Rectangle-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/RYYJr8y/Rectangle-1.png', label: '' },
			], title: 'Название продукта 11', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 12, images: [
				{ id: 1, image: 'https://i.ibb.co/zJ9mDwf/image-2-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/zJ9mDwf/image-2-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/zJ9mDwf/image-2-1.png', label: '' },
			], title: 'Название продукта 12', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 13, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 13', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 14, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 14', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 15, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 15', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 16, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 16', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '2 категория'
		},
		{
			id: 17, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 17', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 18, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 18', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 19, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 19', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 20, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 20', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 21, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 21', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 22, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 22', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 23, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 23', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
		{
			id: 24, images: [
				{ id: 1, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 2, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
				{ id: 3, image: 'https://i.ibb.co/CzwQw89/image-1.png', label: '' },
			], title: 'Название продукта 24', description: 'Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.  Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность. Описание продукта Наши продукты направлены на безопасность. Безопасность это Наши продукты направлены на безопасность. Безопасн Наши продукты направлены на безопасность.', category: '3 категория'
		},
	],
	currentPageProducts: 1,
	productsPerPageProducts: 6,
	currentPageBlog: 1,
	productsPerPageBlog: 6,
	paginationPageProducts: [
		{ id: 1, title: 1 },
		{ id: 2, title: 2 },
		{ id: 3, title: 3 },
		{ id: 4, title: 4 },
		{ id: 5, title: 5 },
		{ id: 6, title: 6 },
		{ id: 7, title: 7 },
		{ id: 8, title: 8 },
	],
	footer: [
		{ id: 1, title: '© 2022 LLC Trustcrypt. All rights reserved.' }
	],
	sponsor: [
		{ id: 1, title: 'bosller', img: 'https://i.ibb.co/4FKtZ33/x900-2.png' }
	],
	newTabs: [
		{ id: 1, label: 'За день', active: true },
		{ id: 2, label: 'За неделю', active: false },
		{ id: 3, label: 'За месяц', active: false }
	],
	popUp: false,
};


const reduser = (state = initialState, action: IAction) => {
	const { tabsPageBlog, tabsPageProducts, newTabs, popUp } = state;
	const { type, payload } = action;
	switch (type) {
		case 'CURRNET_PRODUCTS_PAGE_PRODUCTS':
			return {
				...state,
				isLoading: false,
				currentPageProducts: payload,
			}

		case 'UPDATE_ACTIVE_TABS':
			const arrTabs = tabsPageProducts.map(elem => {
				elem.active = false;
				return elem;
			});
			const tabsIndex = arrTabs.findIndex(elem => elem.id === payload);
			const oldItem = arrTabs[tabsIndex];
			const newItem = { ...oldItem, active: true };
			const newArr = [...arrTabs.slice(0, tabsIndex), newItem, ...arrTabs.slice(tabsIndex + 1)];
			return {
				...state,
				isLoading: false,
				currentPageProducts: 1,
				tabsPageProducts: newArr,
			}

		case 'CURRET_NEWS_PAGE_BLOG':
			return {
				...state,
				isLoading: false,
				currentPageBlog: payload,
			}

		case 'UPDATE_ACTIVE_TABS_BLOG':
			const arrTabsBlog = tabsPageBlog.map(elem => {
				elem.active = false;
				return elem;
			});
			const tabsIndexBlog = arrTabsBlog.findIndex(elem => elem.id === payload);
			const oldItemBlog = arrTabsBlog[tabsIndexBlog];
			const newItemBlog = { ...oldItemBlog, active: true };
			const newArrBlog = [...arrTabsBlog.slice(0, tabsIndexBlog), newItemBlog, ...arrTabsBlog.slice(tabsIndexBlog + 1)];
			return {
				...state,
				isLoading: false,
				currentPageBlog: 1,
				tabsPageBlog: newArrBlog,
			}
		case 'UPDATE_ACTIVE_TABS_ARTICLE':
			const arrTabsArticle = newTabs.map(elem => {
				elem.active = false;
				return elem;
			});
			const tabsIndexArticle = arrTabsArticle.findIndex(elem => elem.id === payload);
			const oldItemArticle = arrTabsArticle[tabsIndexArticle];
			const newItemArticle = { ...oldItemArticle, active: true };
			const newArrArticle = [...arrTabsArticle.slice(0, tabsIndexArticle), newItemArticle, ...arrTabsArticle.slice(tabsIndexArticle + 1)];
			return {
				...state,
				isLoading: false,
				newTabs: newArrArticle,
			}
		case 'POP_UP_STATE':
			return {
				...state,
				popUp: !popUp,
			}
		default:
			return state;
	}
};

export default reduser;